{"class_name": "Sequential", "keras_version": "2.2.0", "config": [{"class_name": "Conv2D", "config": {"bias_constraint": null, "use_bias": true, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "strides": [1, 1], "kernel_size": [3, 3], "filters": 64, "dilation_rate": [1, 1], "batch_input_shape": [null, 48, 48, 1], "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_1"}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_1", "gamma_regularizer": null, "trainable": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "valid"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "seed": null, "rate": 0.25, "name": "dropout_1"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "strides": [1, 1], "kernel_size": [5, 5], "filters": 128, "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_2"}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_2", "gamma_regularizer": null, "trainable": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "valid"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "seed": null, "rate": 0.25, "name": "dropout_2"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "strides": [1, 1], "kernel_size": [3, 3], "filters": 512, "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_3"}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_3", "gamma_regularizer": null, "trainable": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "valid"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "seed": null, "rate": 0.25, "name": "dropout_3"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "strides": [1, 1], "kernel_size": [3, 3], "filters": 512, "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_4"}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_4", "gamma_regularizer": null, "trainable": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_4", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "valid"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "seed": null, "rate": 0.25, "name": "dropout_4"}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "units": 256, "bias_regularizer": null, "use_bias": true, "name": "dense_1", "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_5", "gamma_regularizer": null, "trainable": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "seed": null, "rate": 0.25, "name": "dropout_5"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "units": 512, "bias_regularizer": null, "use_bias": true, "name": "dense_2", "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_6", "gamma_regularizer": null, "trainable": true, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "seed": null, "rate": 0.25, "name": "dropout_6"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "units": 7, "bias_regularizer": null, "use_bias": true, "name": "dense_3", "activity_regularizer": null, "activation": "sigmoid", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null}}], "backend": "tensorflow"}